/* =================================================================================

-------------------------------------------------------------------------------------
                                                 
------------------------------------------------------------------------------*/

typedef struct 	{ _iq  u_e_pu; 			/* Вход: напряжение возбуждение (о.е)  */
				  _iq  u_a_pu;			/* Вход: напряжение на якоре  (о.е) */
			      _iq  Mc_pu;		/* Вход: момент сопротивления (о.е)  */	  			      
				  _iq  i_e_pu;			/* Выход: ток обмотки возбуждения (о.е)  */			
				  _iq  i_a_pu;			/* Выход: ток якоря (о.е)  */
					_iq u_emf_pu;		/* Выход: Противо-ЭДС */ 
				  _iq  M_pu; 			/* Выход: момент (о.е)  */		
				  _iq  W_pu;			/* Выход: электрическая частота (о.е)  */
				  _iq  K1;				/* Параметр:   */
			      _iq  K2;				/* Параметр:   */
			      _iq  K3;				/* Параметр:   */
			      _iq  K4;				/* Параметр:   */
			      _iq  K5;				/* Параметр:   */
			      _iq  Ts;				/* Параметр:   время дискретизации*/			      
			   	 void   (*calc)();	    /* Указатель на функцию счета*/ 
				} BDCM;
																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																				
typedef BDCM *BDCM_handle;

/*-----------------------------------------------------------------------------
Инициализация по умолчанию для обекта BDCM
-----------------------------------------------------------------------------*/                     
#define BDCM_DEFAULTS { 0,0,0,0, \
                       0,0,0,0,0, \
 		          	   0,0,0,0,0, \
 		              (void (*)(long))bdcm_calc }

/*------------------------------------------------------------------------------
прототип функции в файле BDCM.C
------------------------------------------------------------------------------*/
void bdcm_calc(BDCM_handle);
