/*=====================================================================================                
Ôóíêöèÿ ïîäñ÷åòà ìîäåëè ÄÏÒ ñ ÍÂ
=====================================================================================

-------------------------------------------------------------------------------------*/

#include "fxptMath.h"     
#include "bdcm.h"

inline void bdcm_calc(BDCM *v)
{	

// ñ÷èòàåì îáìîòêó âîçáóæäåíèÿ
v->i_e_pu = _IQmpy( v->K1, v->u_e_pu ) + _IQmpy( v->K2, v->i_e_pu);
// ñ÷èòàåì ıäñ è òîê ÿêîğÿ
v->u_emf_pu = _IQmpy( v->i_e_pu, v->W_pu );
v->i_a_pu = _IQmpy( v->K3, ( v->u_a_pu - v->u_emf_pu ) ) + _IQmpy( v->K4, v->i_a_pu );
//ñ÷èòàåì ıëåêòğîìàãíèòíûé ìîìåíò
v->M_pu = _IQmpy( v->i_e_pu, v->i_a_pu );
//ñ÷èòàåì ñêîğîñòü
v->W_pu = _IQmpy( v->K5, ( v->M_pu - v->Mc_pu ) ) + v->W_pu;
//
}


